backend/performance_test.yaml
config:
  target: "http://localhost:5050"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
  processor: "./functions.js"

scenarios:
  - name: "Browse Locations"
    flow:
      - get:
          url: "/api/health"
      - get:
          url: "/api/urban/locations"